{
  "Welcome": "Bienvenue",
  "Home": {
    "DeveloperJunior": "Développeur junior",
    "name": "Bonjour, je suis Arthur BRU",
    "developerJV": "Bonjour, je suis un développeur de Jeu Vidéo",
    "developerWeb": "Bonjour, je suis un développeur de Jeu Vidéo",
    "role": "C++ Développeur",
    "info": "Actuellement en Bachelor en développement informatique option jeu vidéo au Gaming Campus en 3ème année de G.Tech et je recherche un Stage et une alternance dès le 15 mai 2025.",
    "discover": "Me découvrir",
    "title1": "A propos de moi",
    "aboutMe": "Grâce à mes expériences, j'ai pu perfectionner mes compétences techniques et collaborer efficacement avec d'autres filières telles que la filière artistique ou bien marketing. En dehors de mes études, je suis passionné par le basket !",
    "title2": "Technologies et Outils",
    "Unity": "Unity",
    "C": "C Langage",
    "C#": "C# Langage",
    "C++": "C++ Langage",
    "PHP": "PHP",
    "HTML": "HTML",
    "CSS": "CSS",
    "MySQL": "MySQL",
    "MySQLDescription": "Je connais et pratique MySQL depuis 4 ans, en utilisant notamment phpMyAdmin. Mon expérience avec LUA et PHP m'a permis de faire des progrès significatifs dans la manipulation des données avec MySQL.<br></br> J'ai principalement utilisé deux interfaces pour travailler avec les bases de données :<br></br><br></br>- phpMyAdmin : Pour sa facilité d'utilisation, la gestion des tâches courantes et la sécurité.<br></br>- DBeaver : Je préfère l'utilisé pour du linux et pour ses fonctionnalités avancées et son support multiplateforme.",
    "Git": "Git",
    "GitDescription": "J'ai commencé à utiliser Git en octobre 2023, et depuis lors, il est devenu un outil essentiel pour moi. Sa commodité et sa rapidité, une fois les commandes maîtrisées, en font un outil fantastique. Je suis à l'aise avec les commandes standard pour la gestion de projets.",
    "Bootstrap": "Bootstrap 5",
    "Python": "Python",
    "React": "React (Front-End)",
    "LUA": "LUA",
    "JavaScript": "JavaScript",
    "TypeScript": "TypeScript"
  },
  "ClassicNavBar": {
    "Home": "Accueil",
    "AboutMe": "À propos de moi",
    "Projects": "Projets",
    "CV": "CV",
    "GameJam": "Game Jam",
    "Unity": "Unity",
    "ContactMe": "Contact",
    "Incoming": "Projets à venir 2024-2025"
  },
  "TypeCV": {
    "CVJV": "CV Jeu vidéo",
    "CVWeb": "CV Web"
  },
  "TopNavBarProjects": {
    "Home": "Accueil",
    "AboutMe": "À propos de moi",
    "Language": "Langage",
    "Projects": "Projets",
    "CV": "CV",
    "ContactMe": "Contact"
  },
  "BottomNavBarProjects": {
    "Category": "Catégorie",
    "C": "C Langage",
    "CustomEngine": "Moteur Custom",
    "C++": "C++ Langage",
    "CSharp": "C# Langage",
    "Python": "Python",
    "LUA": "LUA",
    "Unity": "Unity",
    "PaymentPage": "Page de Paiement"
  },
  "VideoGamesProjects": {
    "playVideo": "Lancer la vidéo",
    "stopVideo": "Arrêter la vidéo",
    "learnMore": "En savoir plus",
    "viewMoreCode": "Voir le dépôt",
    "viewMoreGame": "Voir le jeu",
    "playProjects": "Jouer",
    "stopProjects": "Arrêter",
    "fullScreenGame": "Plein écran",
    "helluvaRevenge": "Voici un jeu vidéo réalisé en l'espace de 4 semaines, nous devions faire toutes la partie développement et création/recherche d'assets. Le jeu a été réalisé avec la bibliothèque SFML sur un moteur custom.<br></br>- Groupe de 6 étudiants.",
    "towerDefense": "Voici un Tower Defense réalisé en 1 semaine sur le thème de League of Legends.<br>- Groupe de 5 étudiants.",
    "platformer": "Voici un platformer 2D réalisé en 2 semaines à l'aide d'un moteur fournit par l'intervenant.<br>- Groupe de 4 étudiants.",
    "bibliotheque": "Dans ce projet, nous devions faire nos propres bibliothèque, nous avions 1 semaines pour faire les bibliothèques suivantes : Vector, Container, Collision et un début de GameObject. Nous avons également vu les test unitaire pour tester nos bibliothèques<br>- Groupe de 3 étudiants.",
    "TextuelGameConsole": "Voici le premier projet réalisé en C++, c'est un jeu textuel, tour par tour, sur le thème de One Piece. C'étais un projet pour la transition entre le C et le C++ pour bien acquérir les bases, nous avions 1 semaine.<br>- Groupe de 2 étudiants.",
    "shootEmUp": "Voici le grand projet réalisé en fin de première année en l'espace de 2 semaines. Nous étions en collaboration avec la filiare Business qui était chargé de premouvoir le jeu et nous de le développé.<br>- Groupe de 6 étudiants.",
    "luaPart1": "Avant d'intégrer le Gaming Campus, j'ai développé en LUA sur la plateforme FiveM pendant environ 4 ans. Cette expérience m'a permis d'acquérir de solides connaissances en gestion et création de bases de données, et j'ai eu l'occasion de travailler sur Linux pour gérer différents serveurs. Au cours de ces 4 années, j'ai également créé le projet ",
    "luaPart2": ", me permettant de partager mon contenu avec ma communauté. Aujourd'hui, j'ai arrêté le projet Polo Leaks car j'ai exploré toutes les possibilités qu'il offrait.",
    "CSharpConsole": "Jeu en console, un jeu au tour par tour réalisé en 2 semaines. Nous devions créer une carte en ASCII et la rendre attrayante. Nous avons choisi le thème de One Piece et pour le système de combat, nous devions créer 3 types d'IA : Facile, Normal et Difficile. Nous avons également fait des Test unitaires.<br></br>- Groupe de 4 étudiants.",
    "UnityRL": "Un jeu développé en 2 semaines sur le moteur de jeu Unity avec plusieurs fonctionnalités telles que la génération procédurale, la courbe d'animation, l'IA de drones, la gestion des entrées, les coroutines, OpenProBuilder et d'autres bases de Unity.<br><br>- Groupe de 2 étudiants.",
    "CustomEngine": "Durant ma 2ème année, j'ai pu avoir la chance de réaliser un moteur custom avec Vulkan en C++. Je me suis principalement occupé de la partie réseau, c'est-à-dire des protocoles TCP et UDP et également de l'intégration du son via la librairie FMOD. Le projet était sur 1 mois.<br><br>- Groupe de 8 étudiants."
  },
  "WebProjects": {
    "learnMore": "En savoir plus",
    "Celtic": "Site web pour une association de basketball créé en 2 mois. Nous étions 100 % bénévoles pour le réaliser.<br></br>- Projet personnel, nous étions 2 développeurs.",
    "Eko": "Eko est un site de vente en ligne qui propose également des abonnements. Il a été réalisé en 2 semaines.<br></br>- Groupe de 4 étudiants",
    "BAImmobilier": "Site web pour le Bac, c'était mon premier site créé. L'objectif était de créer une entreprise fictive mais réaliste.",
    "GoudGuys": "Site web pour une association esport créé en 1 mois lors d'un stage.<br></br>- Nous étions 2 développeurs.",
    "ShoppingSystem": "Voici une page de paiement et un panier inspirés du site web JD Sport, créés en 1 semaine.<br></br>- Projet personnel<br></br>- API de paiement : Stripe & Paypal",
    "React": "Site web réalisé en première année. Le but était de prendre une API de film fourni par l'intervenant et nous devions faire un premier catalogue avec des filtres.<br></br>- Premier projet en React<br></br>- Projet d'un étudiant",
    "ReactPortfolio": "Portfolio développé en React JS, intégrant les bibliothèques suivantes : Axios, i18next, Font Awesome et emailjs-com.<br></br>Les technologies utilisées comprennent React, HTML et CSS.<br></br>J'ai porté une attention particulière au référencement (SEO) avec l'optimisation pour Google Search, l'utilisation d'une Sitemap et l'implémentation de balises appropriées."
  },
  "ContactMe": {
    "title": "Me Contacter",
    "name": "Nom",
    "prenom": "Prénom",
    "mail": "Mail",
    "message": "Message",
    "submit": "Envoyer",
    "submitInProgress": "Envoie en cours..."
  },
  "DropdownCV": {
    "CVWeb": "CV Web",
    "CVJV": "CV Jeu vidéo"
  },
  "DropdownProjects": {
    "ProjectVideoGames": "Projets Jeu Vidéo",
    "ProjectWeb": "Projets Web"
  },
  "DropdownLanguage": {
    "FrenchLanguage": "Français",
    "EnglishLanguage": "Anglais",
    "SpanishLanguage": "Espagnol"
  },
  "GameJam": {
    "Title": "Mes jeux de Game Jam",
    "Chocolato": {
      "Description": "J'ai participé à une Game Jam organisé par l'école où j'étudie. Nous avions 48 heures pour réaliser un Jeu sur le thème 'Contraste Dynamique' et comme Direction Artistique 'Chocolat'. J'ai beaucoup apprécié participer à ma première Game Jam où j'ai pu apprendre et échanger au cours du concours.",
      "LearnMore": "En savoir plus",
      "Alert": "Pour une meilleur expérience, il vous faut une manette.",
      "LoadingGame": "Chargement du jeu...",
      "GameInProgress": "Jeu en cours",
      "technologies": "Technologie utilisé : Unity"
    },
    "StaySoul": {
      "Description": "J'ai participé à ma deuxième Game Jam organisé par l'école mon école en collaboration avec Tap Nation. Nous avions 42 heures pour réaliser un Jeu sur le thème 'Jeux d'enfants'. Grâce à mes précèdents projets et à mes compétences, acquises j'ai pu les appliquer pour rendre un jeu jouable avec mes camarades.",
      "Alert": "Pour une meilleur expérience, il vous faut un clavier."
    }
  },
  "Unity": {
    "Title": "Mes jeux/projets Unity",
    "ShadowScholar": {
      "Description": "Pour valider ma deuxième année au sein du Gaming Campus j'ai réaliser un stage où j'étais chargé d'imaginer et de développer le jeu 'Shadow Scholar : La fac ultime'. J'ai pu perfectionner mes connaissances en programmation C# et découvrir / améliorer certaines fonctionnalités sur Unity tels que l'outil Timeline, Cinemachine, Sauvegarde Json, Profiler, Skeleton Animation, Animator, AI Navigation et j'ai également pu toucher à des extensions tels que GeNa et Autofence Builder.<br></br>- Nous étions 2 Développeurs",
      "LearnMore": "En savoir plus",
      "technologies": "Technologie utilisé : Unity"
    },
    "NavyBongo": {
      "Description": "Voici un projet de jeu vidéo sur Unity en individuel. J'avais un peu plus d'une semaine pour réaliser le jeu. Vous incarnez un bateau et le but du jeu est de détruire toutes les tours ennemies dans le temps impartie. Pour cela plsu vous avancez dans la partie, plus vous obtenez des bateaux plus puissant!",
      "LearnMore": "En savoir plus",
      "technologies": "Technologie utilisé : Unity"
    }
  },
  "Incoming": {
    "1": "Programmation avancées - C++",
    "2": "Encapsulation - C++",
    "3": "Intelligence Artificielle - C++",
    "4": "Unity 3D - C#",
    "5": "Unity Shaders",
    "6": "Unity UI/UX",
    "7": "Unreal BluePrint - C++",
    "8": "Unreal C++",
    "9": "Unreal Physique Avancée",
    "10": "Gestion de Production & Publishing dans le Jeu Vidéo"
  }
}
