{
  "Welcome": "Bienvenido",
  "Home": {
    "name": "Hola, soy Arthur BRU",
    "developerJV": "Hola, soy un desarrollador de videojuegos.",
    "developerWeb": "Hola, soy un desarrollador web.",
    "role": "Desarrollador de C++",
    "info": "Actualmente, estoy estudiando en Gaming Campus en mi segundo año de G.Tech, y estoy buscando una pasantía para mayo de 2024.",
    "discover": "Descúbreme",
    "title1": "Acerca de mí",
    "aboutMe": "Gracias a mis experiencias, he podido perfeccionar mis habilidades técnicas y colaborar eficazmente con otras ramas como la rama artística o de marketing. Fuera de mis estudios, ¡soy apasionado por el baloncesto!",
    "title2": "Tecnologías y Herramientas",
    "Unity": "Unity",
    "C": "Lenguaje C",
    "C#": "Lenguaje C#",
    "C++": "Lenguaje C++",
    "PHP": "PHP",
    "JavaScript": "JavaScript",
    "HTML": "HTML",
    "CSS": "CSS",
    "MySQL": "MySQL",
    "MySQLDescription": "Llevo 4 años conociendo y practicando MySQL, utilizando especialmente phpMyAdmin. Mi experiencia con LUA y PHP me ha permitido progresar considerablemente en la manipulación de datos con MySQL.<br></br>He utilizado principalmente dos interfaces para trabajar con bases de datos:<br></br><br></br>- phpMyAdmin: Por su facilidad de uso, gestión de tareas comunes y seguridad.<br></br>- DBeaver: Por sus características avanzadas y su soporte multiplataforma.",
    "Git": "Git",
    "GitDescription": "Comencé a usar Git en octubre de 2023 y desde entonces se ha convertido en una herramienta imprescindible para mí. Su utilidad y rapidez una vez dominados los comandos lo convierten en una herramienta formidable. Estoy cómodo con los comandos clásicos para la gestión de proyectos.",
    "Bootstrap": "Bootstrap 5",
    "Python": "Python",
    "React": "React (Front-End)",
    "LUA": "LUA"
  },
  "ClassicNavBar": {
    "Home": "Inicio",
    "AboutMe": "Sobre mí",
    "Projects": "Proyectos",
    "CV": "CV",
    "ContactMe": "Contáctame"
  },
  "TypeCV": {
    "CVJV": "CV de Videojuegos",
    "CVWeb": "CV Web"
  },
  "TypeProjects": {
    "ProjectsJV": "Proyectos de Videojuegos",
    "ProjectsWeb": "Proyectos Web"
  },
  "TopNavBarProjects": {
    "Home": "Inicio",
    "AboutMe": "Sobre mí",
    "Language": "Idioma",
    "Projects": "Proyectos",
    "CV": "CV",
    "ContactMe": "Contáctame"
  },
  "BottomNavBarProjects": {
    "Category": "Categoría",
    "C": "Lenguaje C",
    "C++": "Lenguaje C++",
    "CSharp": "Lenguaje C#",
    "Python": "Python",
    "LUA": "LUA",
    "PaymentPage": "Página de pago"
  },
  "VideoGamesProjects": {
    "learnMore": "Más información",
    "playProjects": "Jugar",
    "stopProjects": "Parar",
    "fullScreenGame": "Pantalla completa",
    "helluvaRevenge": "Aquí tienes un videojuego creado en el espacio de 4 semanas; tuvimos que encargarnos de todos los aspectos del desarrollo y la creación/investigación de activos. El juego se desarrolló en C++ con la biblioteca SFML en un motor personalizado.<br></br>- Grupo de 6 estudiantes.",
    "towerDefense": "Aquí tienes un juego de Tower Defense desarrollado en 1 semana con el tema de League of Legends.<br>- Grupo de 5 estudiantes.",
    "platformer": "Aquí tienes un platformer 2D creado en 2 semanas utilizando un motor proporcionado por el instructor.<br>- Grupo de 4 estudiantes.",
    "bibliotheque": "En este proyecto, teníamos que crear nuestras propias bibliotecas. Tuvimos 1 semana para desarrollar las siguientes bibliotecas: Vector, Container, Collision y un comienzo de GameObject. También exploramos pruebas unitarias para evaluar nuestras bibliotecas.<br>- Grupo de 3 estudiantes.",
    "textuelGameConsole": "Aquí está el primer proyecto realizado en C++, es un juego textual por turnos basado en el tema de One Piece. Fue un proyecto para la transición entre C y C++ con el fin de adquirir bien los fundamentos; teníamos 1 semana.<br>- Grupo de 2 estudiantes.",
    "shootEmUp": "Aquí está el gran proyecto realizado al final del primer año en un lapso de 2 semanas. Colaboramos con la filial de Negocios que se encargaba de promover el juego, mientras nosotros nos ocupábamos de desarrollarlo.<br>- Grupo de 6 estudiantes.",
    "luaPart1": "Antes de unirme al Gaming Campus, desarrollé en LUA en la plataforma FiveM durante aproximadamente 4 años. Esta experiencia me permitió adquirir sólidos conocimientos en gestión y creación de bases de datos, y tuve la oportunidad de trabajar en Linux para administrar diferentes servidores. A lo largo de estos 4 años, también creé el proyecto",
    "luaPart2": ", que me permitió compartir mi contenido con mi comunidad. Hoy, he detenido el proyecto Polo Leaks porque he explorado todas las posibilidades que ofrecía.",
    "CSharpConsole": "Juego en consola, un juego por turnos realizado en 2 semanas. Teníamos que crear un mapa en ASCII y hacerlo atractivo. Elegimos el tema de One Piece y para el sistema de combate, teníamos que crear 3 tipos de IA: Fácil, Normal y Difícil. También realizamos pruebas unitarias.<br></br>- Grupo de 4 estudiantes.",
    "UnityRL": "Un juego desarrollado en 2 semanas utilizando el motor de juego Unity con varias características como generación procedural, Animation Curve, IA de drones, gestión de entradas, Corrutinas, OpenProBuilder y otros fundamentos de Unity.<br></br>- Grupo de 2 estudiantes."
  },
  "WebProjects": {
    "learnMore": "Más información",
    "Celtic": "Sitio web para una asociación de baloncesto realizado en 2 meses. Éramos 100% voluntarios para hacerlo.<br></br>- Proyecto personal, éramos 2 desarrolladores.",
    "Eko": "Eko es un sitio de venta en línea que también ofrece suscripciones. Se realizó en 2 semanas.<br></br>- Grupo de 4 estudiantes",
    "BAImmobilier": "Sitio web para el Bachillerato, fue mi primer sitio realizado. El objetivo era crear una empresa ficticia pero que pareciera real.",
    "GoudGuys": "Sitio web para una asociación de deportes electrónicos realizado en 1 mes durante un período de prácticas.<br></br>- Éramos 2 desarrolladores.",
    "ShoppingSystem": "Aquí tienes una página de pago y un carrito inspirado en el sitio JD Sport, realizado en 1 semana.<br></br>- Proyecto personal<br></br>- API de pago: Stripe y Paypal",
    "React": "Sitio web realizado en primer año. El objetivo era tomar una API de películas proporcionada por el instructor y debíamos crear un primer catálogo con filtros.<br></br>- Primer proyecto en React<br></br>- Proyecto de 1 estudiante",
    "ReactPortfolio": "Portafolio desarrollado en React JS, integrando las siguientes bibliotecas: Axios, i18next, Font Awesome y emailjs-com.<br></br>Las tecnologías utilizadas incluyen React, HTML y CSS.<br></br>Se ha prestado especial atención a la Optimización para Motores de Búsqueda (SEO) con la optimización para Google Search, el uso de un Sitemap y la implementación de etiquetas apropiadas."
  },
  "ContactMe": {
    "title": "Contáctame",
    "name": "Apellido",
    "prenom": "Nombre",
    "mail": "Correo electrónico",
    "message": "Mensaje",
    "submit": "Enviar",
    "submitInProgress": "Enviando..."
  },
  "DropdownCV": {
    "CVWeb": "CV Web",
    "CVJV": "CV de Videojuegos"
  },
  "DropdownProjects": {
    "ProjectVideoGames": "Proyectos de Videojuegos",
    "ProjectWeb": "Proyectos Web"
  },
  "DropdownLanguage": {
    "FrenchLanguage": "Francés",
    "EnglishLanguage": "Inglés",
    "SpanishLanguage": "Español"
  }
}
