{
  "Welcome": "Welcome",
  "Home": {
    "DeveloperJunior": "Junior developer",
    "name": "Hello, I am Arthur BRU",
    "developerJV": "Hello, I am a video game developer.",
    "developerWeb": "Hello, I am a game developer.",
    "role": "C++ Developer",
    "info": "Currently pursuing a Bachelor's degree in Computer Development with a specialization in video game design at Gaming Campus in my second year of G.Tech, and I am seeking an internship starting May 15th.",
    "discover": "Discover Me",
    "title1": "About Me",
    "aboutMe": "Thanks to my experiences, I have been able to refine my technical skills and collaborate effectively with other fields such as the artistic or marketing field. Outside of my studies, I am passionate about basketball!",
    "title2": "Technologies and Tools",
    "Unity": "Unity",
    "C": "C Language",
    "C#": "C# Language",
    "C++": "C++ Language",
    "PHP": "PHP",
    "JavaScript": "JavaScript",
    "HTML": "HTML",
    "CSS": "CSS",
    "MySQL": "MySQL",
    "MySQLDescription": "I have known and practiced MySQL for 4 years, using phpMyAdmin in particular. My experience with LUA and PHP has allowed me to make significant progress in data manipulation with MySQL.<br></br> I have primarily used two interfaces to work with databases:<br></br><br></br>- phpMyAdmin: For its ease of use, management of common tasks, and security.<br></br>- DBeaver: For its advanced features and cross-platform support.",
    "Git": "Git",
    "GitDescription": "I started using Git in October 2023, and since then, it has become an essential tool for me. Its usefulness and speed, once the commands are mastered, make it a fantastic tool. I am comfortable with standard commands for project management.",
    "Bootstrap": "Bootstrap 5",
    "Python": "Python",
    "React": "React (Front-End)",
    "LUA": "LUA",
    "TypeScript": "TypeScript"
  },
  "ClassicNavBar": {
    "Home": "Home",
    "AboutMe": "About Me",
    "Projects": "Projects",
    "CV": "CV",
    "GameJam": "Game Jam",
    "Unity": "Unity",
    "ContactMe": "Contact Me"
  },
  "TypeCV": {
    "CVJV": "Video Game CV",
    "CVWeb": "Web CV"
  },
  "TopNavBarProjects": {
    "Home": "Home",
    "AboutMe": "About Me",
    "Language": "Language",
    "Projects": "Projects",
    "CV": "CV",
    "ContactMe": "Contact Me"
  },
  "BottomNavBarProjects": {
    "Category": "Category",
    "C": "C Language",
    "CustomEngine": "Custom Engine",
    "C++": "C++ Language",
    "CSharp": "C# Language",
    "Python": "Python",
    "LUA": "LUA",
    "Unity": "Unity",
    "PaymentPage": "Payment Page"
  },
  "VideoGamesProjects": {
    "learnMore": "Learn More",
    "playProjects": "Play",
    "stopProjects": "Stop",
    "fullScreenGame": "FullScreen",
    "helluvaRevenge": "Here is a video game created within 4 weeks; we had to handle all aspects of development and asset creation/research. The game was developed in C++ using the SFML library on a custom engine.<br></br>- Group of 6 students.",
    "towerDefense": "Here is a Tower Defense game developed in 1 week with the theme of League of Legends.<br>- Group of 5 students.",
    "platformer": "Here is a 2D platformer created in 2 weeks using an engine provided by the instructor.<br>- Group of 4 students.",
    "bibliotheque": "In this project, we had to create our own libraries. We had 1 week to develop the following libraries: Vector, Container, Collision, and an initial version of GameObject. We also explored unit testing to test our libraries.<br>- Group of 3 students.",
    "textuelGameConsole": "Here is the first project implemented in C++, it's a text-based, turn-based game based on the theme of One Piece. It was a project to transition from C to C++ to solidify the fundamentals; we had 1 week.<br>- Group of 2 students.",
    "shootEmUp": "Here is the major project completed at the end of the first year within a span of 2 weeks. We collaborated with the Business department, which was responsible for promoting the game, while we focused on its development.<br>- Group of 6 students.",
    "luaPart1": "Before joining the Gaming Campus, I developed in LUA on the FiveM platform for about 4 years. This experience allowed me to acquire strong knowledge in database management and creation, and I had the opportunity to work on Linux to manage various servers. Over these 4 years, I also created the ",
    "luaPart2": ", allowing me to share my content with the community. Today, I have stopped the Polo Leaks project as I have explored all the possibilities it offered.",
    "CSharpConsole": "Game in console, a turn-based game developed in 2 weeks. We had to create an ASCII map and make it attractive. We chose the theme of One Piece, and for the combat system, we had to create 3 types of AI: Easy, Normal, and Hard. We also conducted unit tests.<br></br>- Group of 4 students.",
    "UnityRL": "A game developed in 2 weeks using the Unity game engine with several features such as procedural generation, Animation Curve, Drone AI, Input Management, Coroutines, OpenProBuilder, and other Unity basics.<br></br>- Group of 2 students.",
    "CustomEngine": "During my 2nd year, I had the chance to make a custom engine with Vulkan in C++. I am mainly in charge of the network part, that is to say the TCP and UDP protocols and also the integration of sound via the FMOD library. The project was over 1 month.<br><br>- Group of 8 students."
  },
  "WebProjects": {
    "learnMore": "Learn More",
    "Celtic": "Website for a basketball association created in 2 months. We were 100% volunteers to do it.<br></br>- Personal project, we were 2 developers.",
    "Eko": "Eko is an online sales website that also offers subscriptions. It was completed in 2 weeks.<br></br>- Group of 4 students",
    "BAImmobilier": "Website for the Bac, it was my first website created. The goal was to create a fictitious but realistic company.",
    "GoudGuys": "Website for an esports association created in 1 month during an internship.<br></br>- We were 2 developers.",
    "ShoppingSystem": "Here is a Payment page and a Cart inspired by the JD Sport website, created in 1 week.<br></br>- Personal project<br></br>- Payment API: Stripe & Paypal",
    "React": "Website created in the first year. The goal was to take a movie API provided by the instructor and we had to create an initial catalog with filters.<br></br>- First project in React<br></br>- Project by 1 student",
    "ReactPortfolio": "Portfolio developed in React JS, integrating the following libraries: Axios, i18next, Font Awesome, and emailjs-com.<br></br>The technologies used include React, HTML, and CSS.<br></br>Special attention has been paid to Search Engine Optimization (SEO) with optimization for Google Search, the use of a Sitemap, and the implementation of appropriate tags."
  },
  "ContactMe": {
    "title": "Contact Me",
    "name": "Last Name",
    "prenom": "First Name",
    "mail": "Mail",
    "message": "Message",
    "submit": "Submit",
    "submitInProgress": "Submit in progress..."
  },
  "DropdownCV": {
    "CVWeb": "WEB CV",
    "CVJV": "Video Games CV"
  },
  "DropdownProjects": {
    "ProjectVideoGames": "Video Games Projects",
    "ProjectWeb": "Web Projects"
  },
  "DropdownLanguage": {
    "FrenchLanguage": "French",
    "EnglishLanguage": "English",
    "SpanishLanguage": "Spanish"
  },
  "GameJam": {
    "Title": "My Game Jam games",
    "Chocolato": {
      "Description": "I took part in a Game Jam organized by the school where I study. We had 48 hours to create a game on the theme of 'Dynamic Contrast', with 'Chocolate' as the artistic direction. I really enjoyed taking part in my first Game Jam, where I was able to learn and exchange ideas during the competition.",
      "LearnMore": "Learn More",
      "Alert": "For the best experience, you need a joystick.",
      "LoadingGame": "Game Loading...",
      "GameInProgress": "Game in progress",
      "technologies": "Technology used: Unity"
    }
  },
  "Unity": {
    "Title": "My Unity games/projects",
    "ShadowScholar": {
      "Description": "To validate my second year at the Gaming Campus, I did an internship where I was responsible for imagining and developing the game 'Shadow Scholar: The Ultimate College'. I was able to perfect my knowledge in C# programming and discover / improve certain features on Unity such as the Timeline tool, Cinemachine, Json Backup, Profiler, Skeleton Animation, Animator, AI Navigation and I was also able to touch on extensions such as GeNa and Autofence Builder.<br></br>- We were 2 Developers",
      "LearnMore": "Learn more",
      "technologies": "Technology used: Unity"
    }
  }
}
