{
  "Welcome": "Welcome",
  "Home": {
    "DeveloperJunior": "Gameplay Programmer",
    "name": "Hello, I am Arthur BRU",
    "developerJV": "Hello, I'm Arthur, a Gameplay Programmer.",
    "developerWeb": "Hello, I'm Arthur, a Gameplay Programmer.",
    "role": "C++ Developer",
    "info": "I am currently pursuing a Bachelor's degree in Computer Science with a focus on video game development at Gaming Campus, in my 3rd year of G.Tech. I am actively seeking an internship starting from May 2, 2025, with the possibility of continuing in an apprenticeship for my 4th year.",
    "discover": "My skills",
    "title1": "About Me",
    "aboutMe": "Thanks to my experiences, I have been able to refine my technical skills and collaborate effectively with other fields such as the artistic or marketing field. Outside of my studies, I am passionate about basketball!",
    "title2": "Technologies and Tools",
    "Unity": "Unity",
    "C": "C Language",
    "C#": "C# Language",
    "C++": "C++ Language",
    "PHP": "PHP",
    "JavaScript": "JavaScript",
    "HTML": "HTML",
    "CSS": "CSS",
    "MySQL": "MySQL",
    "MySQLDescription": "I have known and practiced MySQL for 4 years, using phpMyAdmin in particular. My experience with LUA and PHP has allowed me to make significant progress in data manipulation with MySQL.<br></br> I have primarily used two interfaces to work with databases:<br></br><br></br>- phpMyAdmin: For its ease of use, management of common tasks, and security.<br></br>- DBeaver: I prefer to use it for linux and for its advanced features and cross-platform support.",
    "Git": "Git",
    "GitDescription": "I started using Git in October 2023, and since then, it has become an essential tool for me. Its usefulness and speed, once the commands are mastered, make it a fantastic tool. I am comfortable with standard commands for project management.",
    "Bootstrap": "Bootstrap 5",
    "Python": "Python",
    "React": "React (Front-End)",
    "LUA": "LUA",
    "TypeScript": "TypeScript"
  },
  "ClassicNavBar": {
    "Home": "Home",
    "AboutMe": "About Me",
    "Projects": "Projects",
    "CV": "CV",
    "GameJam": "Game Jam",
    "Unity": "Unity",
    "ContactMe": "Contact Me",
    "Incoming": "My Course Schedule 2024-2025"
  },
  "TypeCV": {
    "CVJV": "Video Game CV",
    "CVWeb": "Web CV"
  },
  "TopNavBarProjects": {
    "Home": "Home",
    "AboutMe": "About Me",
    "Language": "Language",
    "Projects": "Projects",
    "CV": "CV",
    "ContactMe": "Contact Me",
    "Unreal": "Unreal"
  },
  "BottomNavBarProjects": {
    "Category": "Category",
    "C": "C Language",
    "CustomEngine": "Custom Engine",
    "C++": "C++ Language",
    "CSharp": "C# Language",
    "Python": "Python",
    "LUA": "LUA",
    "Unity": "Unity",
    "PaymentPage": "Payment Page"
  },
  "VideoGamesProjects": {
    "Title": "My video game projects",
    "playVideo": "Start video",
    "stopVideo": "Stop video",
    "learnMore": "Learn More",
    "viewMoreCode": "View the repository",
    "viewMoreGame": "See the game",
    "playProjects": "Play",
    "stopProjects": "Stop",
    "fullScreenGame": "FullScreen",
    "helluvaRevenge": "Here is a video game created within 4 weeks; we had to handle all aspects of development and asset creation/research. The game was developed in C++ using the SFML library on a custom engine.<br></br>- Group of 6 students.",
    "towerDefense": "Here is a Tower Defense game developed in 1 week with the theme of League of Legends.<br>- Group of 5 students.",
    "platformer": "Here is a 2D platformer created in 2 weeks using an engine provided by the instructor.<br>- Group of 4 students.",
    "bibliotheque": "In this project, we had to create our own libraries. We had 1 week to develop the following libraries: Vector, Container, Collision, and an initial version of GameObject. We also explored unit testing to test our libraries.<br>- Group of 3 students.",
    "textuelGameConsole": "Here is the first project implemented in C++, it's a text-based, turn-based game based on the theme of One Piece. It was a project to transition from C to C++ to solidify the fundamentals; we had 1 week.<br>- Group of 2 students.",
    "shootEmUp": "Here is the major project completed at the end of the first year within a span of 2 weeks. We collaborated with the Business department, which was responsible for promoting the game, while we focused on its development.<br>- Group of 6 students.",
    "luaPart1": "Before joining the Gaming Campus, I developed in LUA on the FiveM platform for about 4 years. This experience allowed me to acquire strong knowledge in database management and creation, and I had the opportunity to work on Linux to manage various servers. Over these 4 years, I also created the ",
    "luaPart2": ", allowing me to share my content with the community. Today, I have stopped the Polo Leaks project as I have explored all the possibilities it offered.",
    "CSharpConsole": "Game in console, a turn-based game developed in 2 weeks. We had to create an ASCII map and make it attractive. We chose the theme of One Piece, and for the combat system, we had to create 3 types of AI: Easy, Normal, and Hard. We also conducted unit tests.<br></br>- Group of 4 students.",
    "UnityRL": "A game developed in 2 weeks using the Unity game engine with several features such as procedural generation, Animation Curve, Drone AI, Input Management, Coroutines, OpenProBuilder, and other Unity basics.<br></br>- Group of 2 students.",
    "CustomEngine": "During my 2nd year, I had the chance to make a custom engine with Vulkan in C++. I am mainly in charge of the network part, that is to say the TCP and UDP protocols and also the integration of sound via the FMOD library. The project was over 1 month.<br><br>- Group of 8 students."
  },
  "WebProjects": {
    "Title": "My Web Projects",
    "learnMore": "Learn More",
    "aboutWebsite": "View the Site",
    "Celtic": "Website for a basketball association created in 2 months. We were 100% volunteers to create it. We did the mockup, development, and deployment of the site.<br></br>- Personal project, we were 2 developers.",
    "CelticTechno": "Technologies used: HTML, CSS, PHP, JavaScript, Ajax, Bootstrap 5, cURL, jQuery, PHPMailer, SweetAlert, PDFjs, MySQL, Stripe API, Facebook Graph API",
    "Eko": "Eko is an e-commerce website that also offers subscriptions. It was created in 2 weeks as part of a school project.<br></br>- Group of 4 students",
    "EkoTechno": "Payment API: Stripe, CSS, Bootstrap 5, PHP, JavaScript",
    "BAImmobilier": "Website created for the Baccalaureate, it was my first website. The goal was to create a fictional but realistic company.",
    "BAImmobilierTechno": "HTML, CSS, JavaScript",
    "GoudGuys": "Website for an esports association created in 1 month during an internship.<br></br>- We were 2 developers.",
    "ShoppingSystem": "Here is a payment page and a shopping cart inspired by the JD Sport website, created in 1 week.<br></br>- Personal project",
    "ShoppingSystemtechno": "Payment API: Stripe & Paypal, CSS",
    "React": "Website created in my first year. The goal was to take a movie API provided by the instructor, and we had to create a first catalog with filters.<br></br>- First project in React<br></br>- Student project",
    "ReactPortfolio": "Portfolio developed in React JS, integrating the following libraries: Axios, i18next, Font Awesome, and emailjs-com.<br></br>The technologies used include React, HTML, and CSS.<br></br>I paid special attention to SEO with optimization for Google Search, use of a Sitemap, and implementation of appropriate tags.",
    "PaymentPageTitle": "Payment Process Design",
    "NoPreview": "Preview unavailable"
  },
  "ContactMe": {
    "title": "Contact Me",
    "name": "Last Name",
    "prenom": "First Name",
    "mail": "Mail",
    "message": "Message",
    "submit": "Submit",
    "submitInProgress": "Submit in progress..."
  },
  "DropdownCV": {
    "CVWeb": "WEB CV",
    "CVJV": "Video Games CV"
  },
  "DropdownProjects": {
    "ProjectVideoGames": "Video Games Projects",
    "ProjectWeb": "Web Projects"
  },
  "DropdownLanguage": {
    "FrenchLanguage": "French",
    "EnglishLanguage": "English",
    "SpanishLanguage": "Spanish"
  },
  "GameJam": {
    "Title": "My Game Jam games",
    "Chocolato": {
      "Description": "I took part in a Game Jam organized by the school where I study. We had 48 hours to create a game on the theme of 'Dynamic Contrast', with 'Chocolate' as the artistic direction. I really enjoyed taking part in my first Game Jam, where I was able to learn and exchange ideas during the competition.",
      "LearnMore": "Learn More",
      "Alert": "For the best experience, you need a joystick.",
      "LoadingGame": "Game Loading...",
      "GameInProgress": "Game in progress",
      "technologies": "Technology used: Unity"
    },
    "StaySoul": {
      "Description": "I participated in my second Game Jam organized by my school in collaboration with Tap Nation. We had 42 hours to create a game on the theme 'Children's Games.' Thanks to my previous projects and the skills I have acquired, I was able to apply them to create a playable game with my teammates.",
      "Alert": "For the best experience, you need a mouse."
    },
    "AttractionFlow": {
      "Description": "Game Jam organized by TapNation X Gaming Campus where the theme was 'Attraction'. We had 42 hours to make a mobile game on this theme, and I am happy to present 'Attraction Flow'. A hyper-casual mobile game that is very easy to pick up!",
      "LearnMore": "Learn more",
      "Alert": "For a better experience, you need a PC or a phone.",
      "LoadingGame": "Loading game...",
      "GameInProgress": "Game in progress",
      "technologies": "Technology used: Unity"
    }
  },
  "Unity": {
    "Title": "My Unity games/projects",
    "ShadowScholar": {
      "Description": "To validate my second year at the Gaming Campus, I did an internship where I was responsible for imagining and developing the game 'Shadow Scholar: The Ultimate College'. I was able to perfect my knowledge in C# programming and discover / improve certain features on Unity such as the Timeline tool, Cinemachine, Json Backup, Profiler, Skeleton Animation, Animator, AI Navigation and I was also able to touch on extensions such as GeNa and Autofence Builder.<br></br>- We were 2 Developers",
      "LearnMore": "Learn more",
      "technologies": "Technology used: Unity"
    },
    "NavyBongo": {
      "Description": "Here is an individual video game project made on Unity. I had a little more than a week to create the game. You play as a boat, and the goal of the game is to destroy all the enemy towers within the allotted time. The further you progress in the game, the more powerful boats you acquire!",
      "LearnMore": "Learn more",
      "technologies": "Technology used: Unity"
    },
    "UIUXCooking": {
      "Description": "This is a solo project on the theme of UI/UX, where I was able to learn how to handle the UI in a fairly comprehensive way. I learned to work with grids, manipulate dropdowns, and use Scriptable Objects to manage my ingredients and recipes. A great project that allowed me to improve my skills in Unity!",
      "Alert": "For the best experience, you need a keyboard.",
      "LearnMore": "Learn more",
      "technologies": "Technology used: Unity"
    }
  },
  "Unreal": {
    "Title": "My Unreal games/projects",
    "Funfair": {
      "Description": "I am very happy to present to you my first project on Unreal Engine 5.4 entirely using Blueprints. The goal of the project was to create a Chamboule tout, bumper cars, and NPCs that move around. Personally, I did more—I added a roller coaster, a coin system (UI Player), and a Ferris Wheel attraction.",
      "LearnMore": "Learn more",
      "technologies": "Technology used: Unreal Engine 5.4"
    },
    "SpacialRace": {
      "Description": "Physics-based project on Unreal Engine 5.4 in a team of 3. We had to implement mechanisms affecting the player's physics. I also learned to use the 'Chaos' tool. It is a project that is half C++ and half Blueprint.",
      "LearnMore": "Learn more",
      "technologies": "Technology used: Unreal Engine"
    }
  },
  "Incoming": {
    "1": "Advanced Programming - C++",
    "2": "Encapsulation - C++",
    "3": "Artificial Intelligence - C++",
    "4": "Unity 3D - C#",
    "5": "Unity Shaders",
    "6": "Unity UI/UX",
    "7": "Unreal BluePrint - C++",
    "8": "Unreal C++",
    "9": "Unreal Physique Advanced",
    "10": "Production & Publishing Management in Jeu Vidéo"
  }
}
